Revit 2027 API
ParameterTypeId.StairstypeGeomunjoinedEndCutStyle Property
 "Connection Method": Cut Style for Geometrically Unjoined End
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeGeomunjoinedEndCutStyle { get; }
Public Shared ReadOnly Property StairstypeGeomunjoinedEndCutStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeGeomunjoinedEndCutStyle {
	ForgeTypeId^ get ();
}
static member StairstypeGeomunjoinedEndCutStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace